Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/2.0.37/atdf/ATSAML11D15A.atdf
        <register name="CFGA" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Config A register">
          <bitfield name="REFNUM" caption="Number of Reference Clock Cycles" mask="0xFF"/>
          <bitfield name="DIVREF" caption="Divide Reference Clock" mask="0x8000"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Register">
          <bitfield name="DONE" caption="Measurement Done" mask="0x1"/>
        </register>
        <register name="STATUS" offset="0xB" rw="RW" size="1" initval="0x00" caption="Status Register">
          <bitfield name="BUSY" caption="FREQM Status" mask="0x1"/>
          <bitfield name="OVF" caption="Sticky Count Value Overflow" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="VALUE" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Count Value Register">
          <bitfield name="VALUE" caption="Measurement Value" mask="0xFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="GCLK" id="U2122" version="1.1.2" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchroniation Busy bit" mask="0x1"/>
          <bitfield name="GENCTRL0" caption="Generic Clock Generator Control 0 Synchronization Busy bit" mask="0x4"/>
          <bitfield name="GENCTRL1" caption="Generic Clock Generator Control 1 Synchronization Busy bit" mask="0x8"/>
          <bitfield name="GENCTRL2" caption="Generic Clock Generator Control 2 Synchronization Busy bit" mask="0x10"/>
          <bitfield name="GENCTRL3" caption="Generic Clock Generator Control 3 Synchronization Busy bit" mask="0x20"/>
          <bitfield name="GENCTRL4" caption="Generic Clock Generator Control 4 Synchronization Busy bit" mask="0x40"/>
        </register>
        <register name="GENCTRL" offset="0x20" rw="RW" size="4" count="5" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0x7" values="GCLK_GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
          <bitfield name="OE" caption="Output Enable" mask="0x800"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000" values="GCLK_GENCTRL__DIVSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
        <register name="PCHCTRL" offset="0x80" rw="RW" size="4" count="21" initval="0x00000000" caption="Peripheral Clock Control">
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0x7" values="GCLK_PCHCTRL__GEN"/>
          <bitfield name="CHEN" caption="Channel Enable" mask="0x40"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="GCLK_GENCTRL__DIVSEL">
        <value name="DIV1" caption="Divide input directly by divider factor" value="0x0"/>
        <value name="DIV2" caption="Divide input by 2^(divider factor+ 1)" value="0x1"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad (GCLK_IO)" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="4"/>
        <value name="OSC16M" caption="OSC16M oscillator output" value="5"/>
        <value name="DFLLULP" caption="DFLLULP output" value="6"/>
        <value name="FDPLL96M" caption="FDPLL output" value="7"/>
      </value-group>
      <value-group name="GCLK_PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
      </value-group>
    </module>
    <module name="IDAU" id="U2803" version="1.0.0" caption="Implementation Defined Attribution Unit">
      <register-group name="IDAU" caption="Implementation Defined Attribution Unit">
        <register name="SECCTRL" offset="0x1" rw="RW" size="1" initval="0x03" caption="SECCTRL">
          <bitfield name="RXN" caption="CPU RAM is eXecute Never" mask="0x4"/>
        </register>
        <register name="SCFGB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="SCFGB">
          <bitfield name="BS" caption="Boot Secure" mask="0xFF"/>
          <bitfield name="BNSC" caption="Boot Secure, Non-secure Callable" mask="0x3F00"/>
          <bitfield name="BOOTPROT" caption="Boot Protection" mask="0xFF0000"/>
        </register>
        <register name="SCFGA" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="SCFGA">
          <bitfield name="AS" caption="Application Secure" mask="0xFF"/>
          <bitfield name="ANSC" caption="Application Secure, Non-secure Callable" mask="0x3F00"/>
          <bitfield name="DS" caption="DATAFLASH Data Secure" mask="0xF0000"/>
        </register>
